#########################################################################################3##############################
# 미션 4:
# 이미지를 HSV 색상 공간으로 변환하여 특정 색상(파란색)을 추출하고, 이를 마스크를 이용해 필터링한 결과를 출력하는 프로그램입니다.
#    - images/person_4.jpg 이미지를 HSV 색상 공간으로 변환하세요.
#    - HSV 색상 공간에서 파란색 영역을 필터링하여 마스크를 생성하세요.
#    - 파란색 영역만 남기고 나머지 색상은 제거된 결과 이미지를 생성하세요.
#    - 결과:
#        - 원본 이미지, HSV 이미지, 생성된 마스크, 그리고 파란색 영역만 추출된 이미지를 화면에 출력.
#    - 조건:
#        - HSV 색공간에서 파란색 범위는 H: 110~130, S: 50~255, V: 50~255.
#    - 주의:
#        - 생성된 마스크와 필터링된 이미지를 정확히 적용하여 결과를 출력하세요.
########################################################################################################################
import cv2

img = cv2.imread('./free_img/person_4.jpg')
hsv_img = cv2.cvtColor(img, cv2.COLOR_BGR2HSV)
lower_blue = (110, 50, 50)
upper_blue = (130, 255, 255)

img_mask = cv2.inRange(hsv_img,lower_blue, upper_blue)
img_result = cv2.bitwise_and(img,img,mask= img_mask)
cv2.imshow('te',img_result)

cv2.waitKey(0)
cv2.destroyAllWindows()
